---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GroupFailures.CannotCreateGroup
source: html/003db3a7-789a-dc15-222d-fe0eae1e559c.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GroupFailures.CannotCreateGroup Property

Cannot create group of these elements.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCreateGroup { get; }
```